{
  "global": {
    "back": "Wstecz",
    "swipe": "Przeciągnij, by zobaczyć więcej",
    "continue": "Kontynuuj",
    "continue_sound": "Kontynuuj z dźwiękiem",
    "popup": "* Okienko jednorazowe"
  },
  "home": {
    "find_out": "Dowiedz się więcej"
  },
  "pages": {
    "about": "O mnie",
    "projects": "Projekty",
    "skills": "Umiejętności",
    "contact": "Kontakt"
  },
  "skills_headers": {
    "order": "Zleć",
    "hire": "Zatrudnij"
  },
  "form": {
    "email": "Twój email",
    "subject": "Temat",
    "message": "Wiadomość"
  },
  "bio": {
    "part1": "Podczas mojej kariery miałem okazję tworzyć ",
    "bold1": "aplikacje webowe",
    "part2": " oraz ",
    "bold2": "na urządzenia mobilne",
    "part3": ", zarówno ",
    "bold3": "stronę klienta",
    "part4": " jak i ",
    "bold4": "serwerową",
    "part5": ". Ok, ale jak to wszystko się zaczęło? Już od najmłodszych lat uwielbiałem rysować - robię to zresztą do dzisiaj. Później, w szkole średniej tworzyłem ",
    "bold5": "projekty budynków",
    "part6": ". Od zawsze była we mnie ta cząstka, która sprawia, że uwielbiam ",
    "bold6": "tworzyć rzeczy",
    "part7": ". Po szkole średniej los chciał, że zacząłem studiować programowanie. Oczywiście pierwsze co wpadło mi w oko było tworzenie ",
    "bold7": "stron internetowych",
    "part8": " oraz ",
    "bold8": "aplikacji mobilnych",
    "part9": ". Od pierwszych tygodni - a nawet dni - nie mogłem przestać zastanawiać się jaką wymyślną aplikację mógłbym stworzyć. Funkcjonalną oraz - oczywiście - ładnie wyglądającą. Aktualnie ",
    "bold9": "akceptuję oferty różnego typu",
    "part10": ", pracuję również na pełny etat jako programista - ",
    "bold10": "Mobile / Frontend Developer",
    "part11": ", co pozwala mi nie tylko przeżyć, ale również zajmować się w życiu czymś, w czym czuję się mocny, co sprawia, że błyszczą mi się oczy na samą myśl o kolejnym dniu spędzonym przy projekcie. Jeśli chcesz mnie zatrudnić lub zlecić urealnienie Twego pomysłu - co pozwoli mi na podzielenie się z Tobą swoją pasją - ",
    "bold11": "wypełnij formularz",
    "part12": " na końcu strony lub wejdź w moje social media i ",
    "bold12": "napisz do mnie",
    "part13": "."
  },
  "skills": [
    {
      "name": "flutter",
      "description": [
        "Programowanie obiektowe",
        "Tworzenie widoków i logiki",
        "Architektura BLoC",
        "Implementacja i modyfikacja paczek",
        "Animacje"
      ]
    },
    {
      "name": "react",
      "description": [
        "React Hooks, Context API",
        "Programowanie funkcyjne",
        "Programowanie obiektowe",
        "Implementacja zewnętrznych bibliotek",
        "Podstawy Redux",
        "NextJS"
      ]
    },
    {
      "name": "javascript",
      "description": [
        "ES6+",
        "Manipulacja DOM-em",
        "Programowanie funkcyjne",
        "Programowanie obiektowe",
        "Async"
      ]
    },
    {
      "name": "typescript",
      "description": [
        "Konwersja kodu JavaScript do TypeScript",
        "Średnio-zaawansowana składnia",
        "React Typescript",
        "Implementacja NextJS"
      ]
    },
    {
      "name": "nodejs",
      "description": [
        "Podstawy ExpressJS",
        "REST API",
        "MVC",
        "Sequelize",
        "Prisma"
      ]
    },
    {
      "name": "html",
      "description": ["Średni-zaawansowana składnia"]
    },
    {
      "name": "css",
      "description": [
        "CSS Grid",
        "Flexbox",
        "SASS",
        "Animacje",
        "Responsywny design"
      ]
    },
    {
      "name": "python",
      "description": [
        "Podstawowa składnia",
        "Podstawowe funkcjonalności",
        "Tworzenie prostych aplikacji webowych",
        "Podstawy Django"
      ]
    },
    {
      "name": "sql",
      "description": ["Składnia MySQL / PostgreSQL", "Łączenie tabel", "T-SQL"]
    }
  ],
  "offers": [
    {
      "name": "web",
      "description": ["Jeśli potrzebujesz strony internetowej, jesteś w dobrym miejscu. Jestem w stanie stworzyć funkcjonalne aplikacje webowe oparte na Twoich preferencjach."]
    },
    {
      "name": "mobile",
      "description": ["Idea aplikacji mobilnej nie daje ci spać? Nie zwlekaj i wyślij mi wiadomość. Tworzenie przyciągających wzrok aplikacji mobilnych nie stanowi dla mnie problemu."]
    },
    {
      "name": "backend/db",
      "description": ["Połączenie aplikacji z bazą jest katorgą? Mogę ci w tym pomóc - zarówno jeśli mowa o modelu bazy danych, jak również z samą komunikacją z uprzednio stworzoną bazą danych. Ze mną przechowywanie danych jest przyjemnością."]
    }
  ],
  "projects": [
    {
      "name": "LazyNFit",
      "description":
        "Moja aplikacja napisana we Flutterze, pozwalająca na Tworzenie własnego planu dietetycznego, dodawanie pomiarów, ich wyświetlanie - wszystko to przy jak najmniejszej ilości kliknięć. Aktualnie czeka na sprawdzenie w Google Play."
    },
    {
      "name": "Energe",
      "description":
        "Strona internetowa dla niderladzkiej firmy renowacyjnej. Głównymi założeniami było zbieranie danych i wyliczenie nowych kosztów - na podstawie danych przechowywanych w ZOHO CRM - po przeprowadzeniu czynności."
    },
    {
      "name": "CopySearcher",
      "description":
        "(Projekt zespołowy) Aplikacja pozwalająca na sprawdzenie czy istnieje plagiat dla danego obrazu, artykułu lub wideo pod wybranymi przez nas adresami popularnych portali."
    },
    {
      "name": "POTG",
      "description":
        "(Projekt zespołowy) Strona internetowa scrappująca informacje odnośnie możliwych przejazdów pozwalająca na rezerwację danej trasy - zwracając klientowi voucher."
    },
    {
      "name": "Meditate",
      "description":
        "(Projekt Zespołowy) Aplikacja mobilna (wstrzymana - czekamy na zawartość od klienta) zawierająca w sobie różnego rodzaju ćwiczenia, w tym medytacje, afirmacje itd. Przechowuje ona również statystyki, które można potem wyświetlić na interaktywych wykresach."
    },
    {
      "name": "ObbSys",
      "description":
        "Mój projekt inżynieryjny dla Centrum Badań Biomedycznych. Jego celem jest kolekcjonowanie oraz zarządzanie danymi, jak również wyświetlanie statystyk informując przy tym czy spożywany przez zwierzę pokarm oraz woda są w normie - czy zwierzę jest chore."
    },
    {
      "name": "FitTracker",
      "description":
        "Wczesny projekt studencki pozwalający na dzielenie się danymi z dietetykiem oraz zarządzeniem przez dietetyka zamkniętą grupą podopiecznych."
    },
    {
      "name": "Opqn",
      "description":
        "Bardzo wczesny projekt studencki - aplikacja webowa pozwalająca na przechowywanie swoich danych, wymiarów oraz wagi."
    },
    {
      "name": "AcareWeb",
      "description":
        "Strona internetowa pozwalająca na zarządzanie zwierzakami oraz ich dobrostanem przez sklepy zoologiczne oraz osoby prywatne. Technologie: NextJS, Prisma, PostgreSQL."
    },
    {
      "name": "Acare",
      "description":
        "Prywatny projekt nad którym aktualnie pracuję (wstrzymany). Aplikacja dla dzikich zwierząt, które nie potrafią się uspokoić (patrzy na swojego chomika-dzika)."
    }
    
  ]
}